# Задача 1. Вариант 4.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Фредерик Аустерлиц. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Григорьева Я.В.
# 18.04.17


print("Фредерик Аустерлиц наиболее известен,как -мериканский актёр, танцор, хореограф и певец. Его псевдоним -  Астер.")
input("Нажмите Enter для выхода")
