# Задача 3. Вариант 4.
#Напишите программу, которая выводит имя "Уильям Сидни Портер", и запрашивает его псевдоним.
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире 

# Григорьева Я.В.
# 18.04.17

name = input('Ульям Сидни Портер какой псевдоним?') 
print('Все верно:Ульям Сидни Портер - О.Генри') 
input ('Нажмите Enter для выхода') 
