# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Попадин Никита Вадимович
# 20.03.2017 

print ("'Лучше быть худшим из лучших, чем лучшим из худших.' \n                           Конфуций, 479 год до н. э.")
input ('Нажмине Enter,чтобы выйти.')
