# Задача 1. Вариант 14.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мари Фрасуа Аруэ. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Попадин Никита Вадимович 

print ('Мари Франсуа Аруэ известен, как знаменитый философ под псведонимом Вольтер')
input ('Нажмите Enter, чтобы выйти')
