# Задача 6. Вариант 24.
# Создайте игру, в которой компьютер загадывает название одной из четырех основных мастей лошадей, а c 

# Chikina E.A.
# 18.04.17.

import random
secret = random.choice(["гнедая", "рыжая", "вороная", "серая"])

print("Программа случайным образом загадывает название одного из четерех основных мастей лошадей. Вам необходимо отгадать какой из мастей загадан.")
luck = input("Ваше предположение: ")
if secret.upper() == luck.upper():
	print("Вы угадали! Это был ", secret)
else:
	print("Вы не угадали! Был загадан: ", secret)
input("Press Enter to exit")