# Задача 4. Вариант 24. 
# Напишите программу, которая выводит имя, под которым скрывается Ефим Алексеевич Придворов. 
# Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер) 
# Вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода. 

# Chikina E.A. 
# 18.04.17. 

Name = "Демьян Бедный" 
print ("Ефим Алексеевич Придворов более известен, как", Name) 
Interests = "русский советский писатель, поэт и общественный деятель." 
print ("\nОбласть интересов: ", Interests) 
PlaceOfBirth = "Губовка, Александрийский уезд, Херсонская губерния." 
print ("\nМесто рождения: ", PlaceOfBirth) 
DateOfBirth = ("1883") 
DateOfBirth = int(DateOfBirth) 
print ("\nГод рождения: ", DateOfBirth) 
DateOfDeath = ("1945") 
DateOfDeath = int(DateOfDeath) 
print ("\nГод смерти: ", DateOfDeath) 
Age = (DateOfDeath - DateOfBirth) 
print ("\nНа момент смерти" ,Name, "было", Age, " лет.") 
input("Press Enter to exit")