# Задача 5. Вариант 24. 
# Напишите программу, которая бы при запуске случайным образом отображала название одной из шести шахматных фигур. 

# Chikina E.A. 
# 18.04.17. 

print ("Данная программа случайным образом отображала название одной из шести шахматных фигур") 
import random 
import string 
# создаем список шахматных фигур 
deer = ["король","ферзь","ладья","слон","конь","пешка"] 
print("\Одна из 6 шахматных фигур называется", random.choice(deer)) 
input("Press Enter to exit")