# Задача 2, Вариант 7
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Стендаль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Иливанова Н.Д.
# 20.04.2017

print ('Стараться быть самим собою — единственное средство иметь успех. \t\t                                                 Стендаль')
input ('Нажмите Enter для выхода')

