# Задача 4, Вариант 7
# Напишите программу, которая выводит имя, под которым скрывается Мария Луиза Чеччарелли. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Иливанова Н.Д.
# 20.04.2017

print("Мария Луиза Чеччарелли более известна, как  итальянская актриса Моника Витти")
born = 1931 
age = 2017-1934
place = "Рим, Королевство Италия"
interess = "кино"
print("Место рождения:",place)
print("Год рождения:",born)
print("Возраст:",age)
print("Область интересов:",interess)
input("Нажмите Enter для выхода")
