# Задача 1, Вариант 7
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Иливанова Н.Д.
# 20.04.2017

print('Эдуард Георгиевич Зюбин – русский поэт, переводчик и драматург, скрывался под псевдонимом Багрицкий ') 
input("Нажмите Enter для выхода")
