# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Rozum R.S.
# 12.04.2017

print("Выберите себе работу по душе, и вам не придется работать ни одного дня в своей жизни.")
print("©Конфуций")

input("\n\nНажмите Enter для выхода.")