# Задача 2. Вариант 14.
# Напише программу, которая выводит имя "Тициано Вечеллио", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Rozum R.S.
# 12.04.2017

name = "Тициано Вечеллио"
print(name)
pen_name = input("Введите псевдоним этого человека: ")
print(name + " - " + pen_name)
input("\n\nНажмите Enter для выхода.")



