# Задача 1. Вариант 14.
# Напишите	программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мари Франсуа Аруэ. После вывода информации	программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Rozum R.S.
# 11.04.2017

print("Французский писатель и философ-просветитель Вольтер (Voltaire), настоящее имя Франсуа-Мари Аруэ (François-Marie Arouet), родился 21 ноября 1694 года в Париже.")

input("\n\nНажмите Enter для выхода.")



