# Задача 3. Вариант 12.
# Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Степанова Н. C.
#18.04.2017
name = ('Тициано Вечеллио') 
print (" Герой нашей сегодняшней программы - " , name) 
psevdonim = input ('Под каким же именем мы знаем этого человека? Ваш ответ : ' ) 
print ('Все верно : ' + name + '-' + psevdonim) 
input ('\n\nНажмите Enter для выхода ')