# Задача 2. Вариант 17.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Ас-Cамарканди. Не забудьте о том,
# что автор должен быть упомянут на отдельной строке.

# Федоров Г.Ю.
# 28.02.2017

print("<<Тот, кто требует лишнего, несчастен..>>")
print('Ас-Самарканди')

input('Нажмите Enter для выхода.')
  