# Задача 3. Вариант 17.
# Напишите программу, которая выводит имя "Симона Руссель", и запрашивает его
# псевдоним. Программа должна сцеплять две эти строки и выводить полученную
# строку, разделяя имя и псевдоним с помощью тире.

# Федоров Г.Ю.
# 28.02.2017


name="Симона Руссель"
print('введите имя', name)
answer=input('какой псевдоним у Симона Руссель ? ')
print('все верно пвсевдоним', name,'-', answer)
input('Нажмите Enter для выхода.') 