# Задача 1. Вариант 17.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Алексей Максимович Пешков. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Федоров Г.Ю.
# 28.02.2017

print('Настоящее имя Максима Горького – Алексей Максимович Пешков, более известен как Русский писатель, прозаик, драматург.')

input('Нажмите Enter для выхода.')
  