#Задача 4. Вариант 17.
#Напишите программу, которая выводит имя, под которым скрывается Грета
#Густафсон. Дополнительно необходимо вывести область интересов указанной
#личности, место рождения, годы рождения и смерти (если человек умер),
#вычислить возраст на данный момент (или момент смерти). Для хранения всех
#необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для
#выхода.

#Федоров Г.Ю.
#28.02.2017


name="Гарбо, Грета"
falshname="Грета Густафсон"
uvlechenia="актерским мастероством"
mestoroshdenia="Стокгольм, Швеция"
mestosmerti="Нью-Йорк, США"
vozvrast="84 года"

print(' ' , falshname , ', настоящее имя ' , name , ' увлекалась ' , uvlechenia , ' . место рождение: ' , mestoroshdenia , ' . место смерти:' , mestosmerti ,' ')
print('на момент смерти ей было ' , vozvrast , ' ')


input('Нажмите Enter для выхода.')
  