# Задача 1. Вариант 22.
# Напишите программу, которая будет сообщать род деятельности
# и псевдоним под которым скрывается Михаил Ефимович Фрилянд.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Kiknadze G.V.
# 2017-02-28

print("Михаил Ефимович Фрилянд имел псевдоним Кольцов.")
print("Род деятельности - русский советский публицист и журналист, писатель, общественный деятель.")
input("Нажмите Enter для выхода")