# Задача 2. Вариант 22.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Демокрит.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Kiknadze G.V.
# 2017-02-28

print("Дружба одного разумного человека дороже дружбы всех неразумных.")
print("                                                                 Демокрит")
input("Нажмите Enter для выхода")