# Задача 2, Вариант 16 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Шамиль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Чернятьев И.К
# 18.04.17

print ('''Если мужчина будет мужчиной, женщина будет женщиной!
 \t\t Шамиль''')
input ('Нажмите Enter для выхода')