# Задача 1, Вариант 16
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Грета Густафсон. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Чернятьев И.К.
# 18.04.17
print('Грета Густафсон Шведская актриса, её псевдоним Грета Гарбо') 
input("Нажмите Enter для выхода")