# Задача 3. Вариант 6.
# Напишите программу, которая выводит имя "Самюэл Ленгхорн Клеменс", и запрашивает его псевдоним. 
# Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Горлов Евгений Михайлович
# 21.02.2017

Psevdonim = input ('Введите псевдоним Самюэла Ленгхорна Клеменса ')
print ('Самюэл Ленгхорн Клеменс-'+Psevdonim)
input ('Введите Enter')

