#ГолубеваE.A.
#1вариант, 4задача
#18.04.17
#Напишите программу, которая выводит имя, под которым скрывается Иво Ливи.
#Дополнительно необходимо вывести область интересов указанной личности,
#место рождения, годы рождения и смерти (если человек умер), вычислить возраст
#на данный момент (или момент смерти). Для хранения всех необходимых данных
#требуется использовать переменные. После вывода информации программа
#должна дожидаться пока пользователь нажмет Enter для выхода.
print("Иво Ливи")
print("Место рождения:Монсуммано-Терме, Тоскана")
print("Год рождеиня: 1921")
print("Год рождения: 1991")
print("Возраст: 70 лет")
print("Область интересов: Актерское мастертво")
input("\n\nНажмите Enter")
