# Задача 2. Вариант 6.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иисус Христос. 
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Горлов Евгений Михайлович
# 21.02.2017

print ('Если глаз твой соблазняет тебя, вырви его и брось от себя.')
print ('C Иисус Христос')
input  ('Введите Enter')