# Задача 4. Вариант 6.
# Напишите программу, которая выводит имя, под которым скрывается София Шиколоне.  
# Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).
# Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Горлов Евгений Михайлович
# 21.02.2017

print ('Софи Лорен')
BirthDay = 1934
print ('Родилась:', BirthDay, "г.")
print ('Место рождение: Рим, Италия')
Age = 2017-BirthDay
print ('Возраст:', Age)
print ('Область интересов: кино,парфюмерия,модельный бизнес')
input ('Введите Enter')

