# Задача 1. Вариант 6.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Йоханнес Бруфельдт. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Горлов Евгений Михайлович
# 21.02.2017

print ('Йоханнес Бруфельдт, Юхани Ахо - писатель')
input  ('Введите Enter')