#задача1.Вариант4.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Фредерик Аустерлец. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Долгова Е.М.
#01.03.2017
print("Фредерик аустерлец - американский актер, танцор, хореограф и певец, известный под псевдонимом Фред астер")
input("\n\nНажмите Enter для выхода.")