# Задача 4. Вариант 4.
# Напишите программу, которая выводит имя, под которым скрывается Джон Гриффит Лондон. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Dolgova E.M.
# 12.04.2017

print("Джон Грффит Лондон более известен, как датский писатель Джек Лондон")
birth="Сан-Франциско, Калифорния"
date="1876"
age="40"
death="1916"
area="Литература"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Дата смерти: ", death)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
