# Задача3. Вариант4.
# Долгова Е.М.
#15.03.2017
#Написать программу, которая запрашивает псевдоним Сидни Портера

print("Герой нашей сегодняшней программы - Сидни Портер")
print("Под каким псевдонимом известен миру Сидни Портер?")
print("Cидни Портер известен миру больше под псевдонимом О. Генри")
input("\n\nНажмите Enter для выхода")

