# Задача 1. Вариант 0.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Evgrashina A. V.
# 22.02.2017

print("Анна Андреевна Горенко более известна, как Анна Ахматова, поэтесса, переводчица и литературовед.")

input("\n\nНажмите Enter для выхода.")