# Задача 2. Вариант 5.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Evgrashina A. V.
# 22.02.2017

print("Держи друзей близко к себе, а врагов еще ближе.")
print("\n\t\t\t\tСунь Цзы")

input("\n\nНажмите Enter для выхода.")