# Задача 3. Вариант 5.
# Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Evgrashina A. V.
# 22.02.2017
name=input('Герой нашей сегоднящней программы - ')
psevd=input('Под каким же именем мы знаем этого человека? Ваш ответ: ')
print('Все верно:', name, '-', psevd)
input("\n\nНажмите Enter для выхода.")