# Задача 3. Вариант 6.
# Напишите программу, которая выводит имя "Самюэл Ленгхорн Клеменс", и запрашивает его псевдоним.
# Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Lukyanov E.A.
# 04.04.2017

print("Герой нашей сегодняшней программы - Самюэл Ленгхорн Клеменс")
name=input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Всё верно:Самюэл Ленгхорн Клеменс - ", name)

input("\n\nНажмите Enter для выхода.")
