# Задача 1. Вариант 6.
# Напишите программу, которая будет сообщать род деятельности и псевдоним,
# под которым скрывается Йоханнес Бруфельдт.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Lukyanov E.A.
# 04.04.2017

print("Юхани Ахо — финский писатель, журналист, переводчик.")

input("\n\nНажмите Enter для выхода.")
