#Задача 1. Вариант 3. 

#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Вильгельм Аполлинарий Костровицкий. 
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
#Enter для выхода. 

#Вырыпаева П. В.
#15.02.2017 

print('Вильгельм Аполлинарий Костровицкий, более известный как французский поэт Гийом Аполлинер') 
input('Нажмите Enter для выхода')
