#Задача 4. Вариант 3

#Напишите программу, которая выводит имя, под которым скрывается Алессандро Филипели. Дополнительно необходимо вывести область интересов указанной
#личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех
#Типы данных, переменные и основы ввода-вывода необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Zak L.S.
#9.04.2017

print("Алессандро Филипели более известен, как  итальянский художник Сандро Боттичелли")

born = 1445 
death = 1510
age = 1510 - 1445
place = "Флоренция, Италия"
interess = "живопись"

print("Место рождения:",place)
print("Год рождения:",born)
print("Год смерти:",death)
print("Возраст:",age)
print("Область интересов:",interess)

input ("Нажмите Enter для выхода")