#Задача 2. Вариант 3

#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Нострадамус. Не забудьте о том,
#что автор должен быть упомянут на отдельной строке.

#Zak L.S.
#7.04.2017

print (''' Жизнь - это череда выборов.
 \t\t Ми́шель де Нострдам''')
input ('Нажмите Enter для выхода')
