#Задача 1. Вариант 3

#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Вильгельм Аполлинарий Костровицкий. После вывода 
#информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Zak L.S.
#7.04.2017

print('Вильгельм Аполлинарий Костровицкий более известен, как российский писатель Костров.')
input('Нажмите Enter для выхода.')