#Задача 2. Вариант 6.

#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иисус Христос. Не забудьте о том, что автор должен быть упомянут на отдельной строке.



#Kim Sergey Evgen'evi4



print("Есть люди, которые много хотят и никуда не продвигаются.")



print("\n\t\t\t\tИИСУС ХРИСТОС")



input("\n\nНажмите Enter, чтобы выйти.")