#Задача 2 Вариант 3
#

#Галахова Елена Дмитриевна
#20.03.2017

print('Жизнь - это череда выборов.') 
print('\t\t\t\t Настрадамус.') 
input('Нажмите Enter')
