#Задача 4 Вариант 3
#

#Галахова Елена Дмитриевна
#20.03.2017

print('К самым значительным художникам раннего Возрождения во Флоренции'+ 
' принадлежит Сандро Боттичелли.'+ 
'Его настоящее имя - Алессандро Филипепи.') 
mesto='Италия, Флоренция' 
god='1445' 
age='65' 
interec='Живопись' 

print('Год рождения:', god) 
print('Место рождения:', mesto) 
print('Возраст:',age) 
print('Область интересов:',interec) 
input('Enter')
