# Задача1. Вариант 24. 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Джон Гриффит Лондон. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода. 

# Chikina E.A. 
# 30.03.17 

print ("Джон Гриффит Лондон-писатель.") 
print ("который скрывается под псевдонимом Джон Гриффит Чейни") 
input("\n \n Нажмите Enter для выхода")