# Задача 2. Вариант 24. 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иоанн (Алексеев). 
# Не забудьте о том, что автор должен быть упомянут на отдельной строке. 

# Chikina E.A. 
# 30.03.17 

print ("Великое благо, что святые отцы оставили нам своим опытом испытанные советы. Чаще заглядывай в книги.") 
print ("\n\t\t\t\t\t\t\t Иоанн (Алексеев).") 
input ("\Press Enter to exit")