# Задача 3. Вариант 24. 
# Напишите программу, которая выводит имя "Максимилиан Гольдман", и запрашивает его псевдоним. 
# Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире. 

# Chikina E.A. 
# 18.04.17. 

print ("Герой нашей сегодняшней программы - Максимилиан Гольдман") 
answer = input("Под каким же именем мы знаем этого человека? Ваш ответ: ") 
if answer == "Макс Рейнхардт": 
	print ("Всё верно: Максимилиан Гольдман - это Макс Рейнхардт.") 
else:
	print ("Не верно")
input("Press Enter to exit")