# Задача 7. Вариант 24.
# Разработайте систему начисления очков для задачи 6, в соответствии с которой игрок получал бы большее количество баллов за меньшее количество попыток.

# Chikina E.A.
# 18.04.17.

import random
xp = 1570
secret = random.choice(["гнедая", "рыжая", "вороная", "серая"])
print("Программа случайным образом загадывает название одного из четерех основных мастей лошадей. Вам необходимо отгадать какой из мастей загадан.")
while 0<1:
		luck = input("Ваше предположение: ")
		if secret.upper() == luck.upper():
			print("Вы не угадали! Это был загадан ", secret, " Получено очко: " , int(xp))
			break
		elif xp<202:
			print("Попытки закончились, очки не начислены!")
			break
		else:
			print("Вы не угадали! Попробуйте еще разок")
			xp*=.71

input("\n\n\n Press Enter to exit")