# Задача 4. Вариант 13.
# Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Torukalo A.U.
# 10.04.2017

print("Жан Батист Поклен более известен, как французский комедиограф Мольер.")
birth="Париж, Франция"
date="1622"
age="51"
death="1673"
area="Театр"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Дата смерти: ", death)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
