# Задача 3. Вариант 13.
# Напишите программу, которая выводит имя "Норма Бейкер", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Torukalo A.U.
# 10.04.2017

print("Герой нашей сегодняшней программы - Норма Бейкер")
name=input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Всё верно: Норма Бейкер - ", name)

input("\n\nНажмите Enter для выхода.")
