# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Конфуций. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.
# Tsukanov K. M.
# 23.03.2017

print("Молчание - верный друг, который никогда не изменит ")
print ("                                              Конфуций")
input ( 'Нажмите Enter чтобы выйти ')