# Задача 1. Вариант 14.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Мари Фрасуа Аруэ. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.
# Tsukanov K. M.
# 23.03.2017

print("Мари Фрасуа Аруэ ")
print ("Один из крупнейших французских философов-просветителей XVIII века: поэт, прозаик   ")
print ('Его псевдоним - Вольтер')
input ( 'Нажмите Enter чтобы выйти ')