# Задача 4. Вариант 14.
# Напишите программу, которая выводит имя, под которым скрывается Михаил
# Ефимович Фрилянд. Дополнительно необходимо вывести область интересов
# указанной личности, место рождения, годы рождения и смерти (если человек
# Типы данных, переменные и основы ввода-вывода
# умер), вычислить возраст на данный момент (или момент смерти). Для хранения
# всех необходимых данных требуется использовать переменные. После вывода
# информации программа должна дожидаться пока пользователь нажмет Enter для
# выхода.
# Tsukanov K. M.
# 23.03.2017
print('Михаил Ефимович Фрилянд более известен, как писатель  Кольцов ')
print('Место рождения:	Киев, Российская империя')
print('Дата рождения:     24 июня 1898')
print('Дата смерти:	   2 февраля 1940')
print('Возраст:           119')
print('Область инетресов: журналистика')
input ('Нажмите Enter , чтобы закрыть')