# Задача 3. Вариант 14.
# Напишите программу, которая выводит имя "Вильгельм Аполлинарий
# Костровицкий", и запрашивает его псевдоним. Программа должна сцеплять две
# эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью
# тире.
# Tsukanov K. M.
# 23.03.2017

c= input( 'Введите Псевдоним --- ')
f=("Вильгельм Аполлинарий Костровицкий --- ")+(c)
print(f)

input ( 'Нажмите Enter чтобы выйти ')
