# Задача 3, Вариант 7 
# Напишите программу, которая выводит имя "Мэри Анн Эванс", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Иливанова Н.Д.
# 20.04.2017

name = "Мари Анн Эванс"
print("Герой нашей сегоднящней программы - " + name)
name2 = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: " + name + " - " + name2)
input("Нажмите Enter для выхода")
