# Задача 2. Вариант 12
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Анвари. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Zemliachyov D.S.
# 13.03.2017

print('Друг — зеркало для друга, нет зеркала светлей!')
print('                            Анвари Авхадиддина')
input('press Enter to exit')