# Задача 1. Вариант 12
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Чеччарелли. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Zemliachyov D.S.
# 14.03.2017


print('Мария Луиза Чеччарелли более известная как Моника Витти.Итальянская актриса 5 раз была удостоена премии «Давид ди Донателло» за лучшую женскую роль.')
input('Press Enter to exit')

#Zemliachyov D.S.
#13.04.2016