#ГолубеваЕ.А.
#1Вариант задача2
#18.04.17
#Напишите программу, которая выводит имя "Иво Ливи", и запрашивает его
#псевдоним. Программа должна сцеплять две эти строки и выводить полученную
#строку, разделяя имя и псевдоним с помощью тире.

name1 = ("Иво Ливи - ")
print(name1)
name2= input("Введите псевдоним:")
print(name1+name2)
input("\n\nНажмите Enter")
