# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам 
# высказывание, автором которого является Юстиниан. Не забудьте о том, что автор должен 
# быть упомянут на отдельной строке.
# Liubchikov I.D.
# 07.03. 2017

print('Является преступлением, когда один человек строит козни другому.')
print
print('Ф.П. Юстиниан')
input('Нажмите Ener для выходa')
