#Задача 4. Вариант 10.
#Напишите программу, которая выводит имя, под которым скрывается Уильям Сидни Портер. 
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, 
#годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или 
#момент смерти). Для хранения всех необходимых данных требуется использовать переменные. 
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter 
#для выхода.
#Liubchikov I.D.
# 07.03. 2017
a = 1910-1862
print("Герой нашей сегодняшней программы - Уильям Сидни Портер, более известен, как мастер американского рассказа О. Генри")
print("Место рождения: город Гринсборо, Северная Каролина\nРодился: 11 сентября 1862\n Умер:5 июня 1910\nВозраст на момент смерти:",(a)) 
print('Область интересов: проза, формацевтика')
input('\n\nНажмите Eter для выхода')
