# Задача 3. Вариант 10.
# Напишите программу, которая выводит имя "Игорь Васильевич Лотарев", и запрашивает его 
# псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, 
# разделяя имя и псевдоним с помощью тире.
# Liubchikov I.D.
# 07.03. 2017

print('Герой нашей сегодняшней программы - Игорь Васильевич Лотарев')
name = input ('Каков его псевдоним: ')
print('\nПод каким же псевдонимом мы знаем этого человека? Ваш ответ: ',name)
print('Все верно'+ ' Игорь Васильевич Лотарев -' ,name)
input('\n\nНажмите Enter, чтобы закрыть')