# Задача 1. Вариант 10.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым 
# скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока 
# пользователь нажмет Enter для выхода.
# Liubchikov I.D.
# 04.03. 2017

print ('Ричард Дейл Дженкинс — американский актёр кино, театра и телевидения.')
print ('псевдоним Бёртон')
input('Нажмите Ener для выходa')
