#Задача 1. Вариант 3
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Вильгельм Аполлинарий Костровицкий. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Галахова Елена Дмитриевна
#16.03.2017

print('Вильгельм Аполлинарий Костровицкий') 
print('Французский поэт, один из наиболее влиятельных'+ 
'деятелей европейского авангарда начала XX века') 
print('В качестве литературного псевдонима Костровицкий') 
print('выбрал французские варианты двух своих имён — Вильгельм и Аполлинарий ') 
input('Нажмите Enter')
