#Задача 3 Вариант 3
#

#Галахова Елена Дмитриевна
#20.03.2017

name=('Чарльз Доджсон') 
print('Герой нашей программы:Чарльз Доджсон') 
psev=input('Под каким же именем мы знаем этого человека? Ваш ответ:')#Лютвидж 
print('Все верно:', name , '-', psev) 
input('Enter')
