# Задача 5. Вариант 4.
#Напишите программу, которая бы при запуске случайным образом отображала один из трех цветов светофора.

# Григорьева Я.В.
# 18.04.17

import random
words=('Зеленый цвет светафора','Желтый цвет светафора.','Красный цвет светафора.')
print(random.choice(words))
input('Нажмите Enter для выхода')
 
