# Задача 4. Вариант 4.
#Напишите программу, которая выводит имя, под которым скрывается Джон Гриффит Лондон.
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Григорьева Я.В.
# 18.04.17
print('Джек Лондон наиболее известен ,как автор приключенческих рассказов и романов.')
background=('Сан-Франциско')
print('Место рождения: ',background)
year=(' 1876')
print('Год рождения:',year)
old=('141')
print('Возраст:', old)
interest=('путешествовать')
print('Область интересов:',interest)

input('Нажмите Enter для выхода ')
 
