#Задача 1. Вариант 14
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мари Фрасуа Аруэ.
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Kartinceva A.U.
#12.04.17

print ("Мари Фрасуа Аруэ-это крупнейший францеский филосов-просветитель XVIII века.")
input("\nPress Enter to exit")