#Задача 2. Вариант 14
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций.
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Kartinceva A.U.
#12.04.17

print ("На самом деле, жизнь проста, но мы настойчиво её усложняем.")
print ("\n\t\t\t\t\tКонфуций.")
input("\n\n\nPress Enter to exit")