#Задача 4. Вариант 12.
 #Напишите программу, которая выводит имя, под которым скрывается Лариса
#Петровна Косач-Квитка. Дополнительно необходимо вывести область интересов
#указанной личности, место рождения, годы рождения и смерти (если человек
#умер), вычислить возраст на данный момент (или момент смерти). Для хранения
#всех необходимых данных требуется использовать переменные. После вывода
#информации программа должна дожидаться пока пользователь нажмет Enter для
#выхода.

#Sedykh E. A.
 #23.04.2017
 
 print ('Лариса Петровна Косач-Квитка более известна, как Леся Украинка')
 bplace = 'Новгород-Волынский'
 bdate = '25 февраля 1871'
 ddate = '1 августа 1913'
 interest = 'поэтесса'
 print ('\nМесто рождения:', bplace)
 print ('\nДата рождения', bdate)
 print ('\nДата смерти:', ddate)
 print ('\nОбласть интересов:', interest)
 
 input ('\nВведите Enter для завершения') 