#Задача 3. Вариант 12.
#Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает
#его псевдоним. Программа должна сцеплять две эти строки и выводить
#3полученную строку, разделяя имя и псевдоним с помощью тире.
#Sedykh E.A.
#23.04.2017
 print ('Персона дня - Тициано Вечеллио')
 alias = input ('Под каким именем он наиболее известен?\t')
 print ('Всё верно, Тициано Вечеллио -' , alias)
 input ('Нажмите Enter для выхода')