# Задача 3, Вариант 12 
# Напишите программу, которая выводит имя "Тициано Вечеллио", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Паноян Л.Т.
# 22.04.2017

name = "Тициано Вечеллио"
print("Герой нашей сегоднящней программы - " + name)
name2 = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: " + name + " - " + name2)
input("Нажмите Enter для выхода")