# Задача 1, Вариант 12 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Чеччарелли. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выходае.

# Паноян Л.Т.
# 22.04.2017
print('Мария Луиза Чеччарелли итальянская актриса, её псевдоним Моника Витти') 
input("Нажмите Enter для выхода")