# Задача 2, Вариант 12 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Анвари. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Паноян Л.Т.
# 22.04.2017

print (''' Для человека мысль - венец всего живого.
 А чистота души есть бытия основа.
 По этим признакам находим человека:
 Всех тварей на земле превыше он от века.
 А если он живёт не мысля и не веря, 
 То человек не отличается от зверя.
 \t\t Анвари Аухад Ад-дин''')
input ('Нажмите Enter для выхода')