# Задача 1. Вариант 10.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Румянцев А.А.
# 15.03.2017

print ('Настоящее имя актёра Ричарда Бёртона - Ричард Уолтер Дженкинс.')

input ('Нажмите Enter')