# Задача 2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Юстиниан.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.


# Румянцев А.А.
# 15.03.2017


print ('Освобождение от рабства относится к праву народов.')
print ('\n\t\t Юстиниан I')

print('\nНажмите Enter.')

