#Задача 2. Вариант 3. 
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Нострадамус. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Вырыпаева П. В.
#19.02.2017

print( 
'''Тот, кого сегодня называют пророк, когда-то назывался провидцем. Иначе говоря - пророк видит вещи, которые недоступны человеческому разуму. 

Нострадамус''') 

input('Нажмите Enter для выхода')
