#Задача 3. Вариант 3. 
#Напишите программу, которая выводит имя "Чарльз Лютвидж Доджсон", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Вырыпаева П. В.
#7.03.2017

print('Сегодня мы познакомим Вас с Чарльз Лютвидж Доджсон') 
name=input('Под каким же именем мы знаем этого человека?') 
print('Ваш ответ-', name) 
print('Все верно: Чарльз Лютвидж Доджсон - ', name) 
input('Нажмите Enter для выхода')

