
#Задача 4. Вариант 3. 

#Напишите программу, которая выводит имя, под которым скрывается Алессандро Филипели. 
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Вырыпаева П. В.
#21.03.2017
print('Алессандро Филипепи скрывается под именем Сандро Боттичелли ') 
background=('Италия, Флоренция') 
print('Место рождения-', background) 
interes=('живописец эпохи Возрождения, представитель флорентийской школы живописи') 
print('Область интересов-',interes) 
godrozhdenia=('1445') 
print('Год рождения-',godrozhdenia) 
godsmerti=('1510') 
print('Год смерти-',godsmerti) 
vozrastnamomentsmerti=('65') 
print('Возраст на момент смерти-',vozrastnamomentsmerti) 
input('Нажмите Enter для выхода')
