# Задача 3, Вариант 5
# Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Исламов Р.Р.
# 10.03.2017

name = "Жан Батист Поклен"
print(name)
name2 = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: " + name + " - " + name2)
input("Нажмите Enter для выхода")

