# Задача 2, Вариант 5
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Исламов Р.Р.
# 05.03.2017

print (''' Когда совершенный человек обладает большими знаниями да к тому же ежедневно проверяет себя и анализирует свое поведение, тогда он мудр и не совершает ошибок.
 \t\t Сюнь-цзы''')
input ('Нажмите Enter для выхода')
