# Задача 1, Вариант 5
# Напишите программу, которая будет сообщать род деятельности и	псевдоним под которым скрывается Анна Андреевна	Горенко. После вывода	информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Исламов Р.Р.
# 02.03.2017

print('Анна Андреевна Горенко поэт, литературовед, переводчик, её псевдоним Анна Ахматова') 
input("Нажмите Enter для выхода")
