# Задача 2. Вариант 11.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является О. Генри. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Ovinnikova T.A.
# 12.04.2017

print('Зажгите свет, я не хочу возвращаться домой в темноте.')
print('                                             О. Генри')
input("\n\nНажмите Enter для выхода.")
