# Задача 3. Вариант 11.
# Напишите программу, которая выводит имя "Анна Андреевна Горенко", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Ovinnikova T.A.
# 12.04.2017

print("Герой нашей сегодняшней программы - Анна Андреевна Горенко")
nick = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: Игорь Васильевич Лотарев -", nick)
input("\n\nНажмите Enter, чтобы выйти.")
