# Задача 2. Вариант 6.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Иисус Христос.
# Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Lukyanov E.A.
# 04.04.2017

print("""
Как хотите, чтобы с вами поступали люди,
так поступайте и вы с ними.
                                                   Иисус Христос""")

input("\n\nНажмите Enter для выхода.")
