# Задача 4. Вариант 6.
# Напишите программу, которая выводит имя, под которым скрывается София Шиколоне.
# Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер),
# Dычислить возраст на данный момент (или момент смерти).
# Для хранения всех необходимых данных требуется использовать переменные.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Lukyanov E.A.
# 04.04.2017

print("София Шиколоне более известна, как итальянская актриса и певица Софи Лорен")
birth="Рим, Королевство Италия"
date="20 сентября 1934"
age="82"
area="Театр и кино"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
