#Задача 2. Вариант 17.
#Напишите	программу,	которая	будет	выводить	на	экран	наиболее	понравившееся вам	высказывание,	автором	которого	является	Ас-Cамарканди.
#Не	забудьте	о	том, что	автор	должен	быть	упомянут	на	отдельной	строке.


#Kurkin M. I.
#19.04.2017
print ("Голод и льва заставляет кидаться на падаль.")
print ("Ас Самарканди")
input ("для выхода из программы нажмите клавишу <Enter>")