# Задача 1. Вариант 10.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Ричард Дженкинс. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Linnik A. M.
# 02.04.2017

print('Рчард Дейл Дженкинс(Джорджик) - американский актёр кино, театра и телевидения.')
input('\n\nНажмите Enter для выхода.')