# Задача 5. Вариант 6
# Напишите программу, которая бы при запуске случайным образом отображала название 
# одной из двадцати башен Московского кремля

# Карагеур Р.М
# 14.03. 2017



import random 
satellites=["Фобос","Деймос"] 
print(random.choice(satellites)) 
input('\nНажмите Enter')
