# Задача 1. Вариант 6
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Мари Фрасуа Аруэ. После вывода информации программа
# должна дожидаться пока пользователь нажмет Enter для выхода.
# Карагеур Р.М
# 23.03.2017


print("Йоханнес Бруфельдт. Псевдоним-Юхани Ахо. Род деятельности: финский писатель, журналист, переводчик")
input("\nPress enter for exit")
