# Задача 2. Вариант 6
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Конфуций. Не забудьте о том, что
# автор должен быть упомянут на отдельной строке.
# Карагеур Р.м
# 23.03.2017

print("Пока ты сам не услышишь истину, никто тебе ее не подскажет./n Иисус Христос")
input("\nPress enter")
