# Задача 3. Вариант 6
# Напишите программу, которая выводит имя "Вильгельм Аполлинарий
# Костровицкий", и запрашивает его псевдоним. Программа должна сцеплять две
# эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью
# тире.
# Карагеур Р.М
# 23.03.2017

псевдоним=input("Введите псевдоним: ")
print("Самюэл Ленгхорн Клеменс-"+псевдоним)
input("\nPress enter for exit")

