# Задача 2. Вариант 22.
#Напишите программу, которая выводит имя "Михаил Ефимович Фрилянд", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.
# Sapegin A.Y.
# 05.03.2017

print('В счастье легко найти друга, в несчастье же — в высшей степени трудно. Демокрит')
input('press Enter to exit')