#Задача 1. Вариант 22
#ННапишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Ефимович Фрилянд. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Sapegin.A.Y.
# 04.03.2017
print('Михаил Ефимович Фрилянд более известен как Михаил Кольцов')
input('\n\nНажмите Enter для выхода.')