# Задача 2. Вариант 9.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эпиктет. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Galizin I.V.
# 22.04.2017

print("В несчастье познаётся и изобличается враг.")

print("Эпиктет")
input("Нажмите Enter чтобы выйти.")