# Задача 1. Вариант 9.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Борис Николаевич Бугаев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.


# Galizin I.V.
# 22.04.2017

print("Эдуард Георгиевич Зюбин более известен, как русский поэт Андрей Белый.")

input("Нажмите Enter для выхода.")