#Задача 1. Вариант 22
#Напишите	программу,	которая	будет	сообщать	род	деятельности	и	псевдоним	под которым	скрывается	Михаил	Ефимович	Фрилянд.	После	вывода	информации программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для	выхода
#Juss A.V.
#18.04.2017

print("русский советский публицист и журналист, писатель, общественный деятель, настоящее имя Михаил Ефимович Кольцов ")

input("\n\nНажмите Enter для выхода.")
