#Задача 2. Вариант 22
#Напишите	программу,	которая	будет	выводить	на	экран	наиболее	понравившееся вам	высказывание,	автором	которого	является	Демокрит.	Не	забудьте	о	том,	что автор	должен	быть	упомянут	на	отдельной	строке.
#Juss A.V.
#18.04.2017

print("Враг не тот, кто наносит обиду, а тот, кто делает это преднамеренно")
print ("©Демокрит")

input("\n\nНажмите Enter для выхода.")
