# Задача 3. Вариант 14.
# Напишите программу, которая выводит имя "Вильгельм Аполлинарий Костровицкий", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Shchetinina V. N.
# 26.03.2017

print('Герой нашей сегодняшней программы - Вильгельм Аполлинарий Костровицкий')

name = input('Под каким же именем мы знаем этого человека? Ваш ответ: ')

print('Все верно: Вильгельм Аполлинарий Костровицкий -', name)

input('\n\nНажмите Enter, чтобы выйти.')
