# Задача 2. Вариант 5.
#Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

# Karmitsky K.S
# 13.04.2017

print("Не поднявшись на высокую гору, не узнаешь высоты неба. Не взглянув в глубокое ущелье в горах, не узнаешь толщины земли. Не услышав заветов предков, не узнаешь величия учености.")
print("\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tСюнь-цзы")
input("\n\nНажмите Enter для выхода")