# Задача 3. Вариант 5.
#Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает
#его псевдоним. Программа должна сцеплять две эти строки и выводить
#полученную строку, разделяя имя и псевдоним с помощью тире.


# Karmitsky K.S
# 13.04.2017

print("Герой нашей сегодняшней программы - Жан Батист Поклен")
a = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно! Жан Батит Поклен ","-\t" + a )