#Задача 2. Вариант 2.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхин. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Andzhukaev E.S.
#10.03.2017
print ("Опьянение показывает душу человека, как зеркало отражает его тело.")
print ("\n\t\t\t\t\t\t\t Эсхин.")
input ('\n\nНажмите Enter для выхода.')