#Задача 1. Вариант 2.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается  Мартин Андерсен. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Andzhukaev E.S.
#10.03.2017

print('Мартин Андерсен более известен,как датский писатель-коммунист Мартин Андерсен-Нексё')
input('\n\nНажмите Enter для выхода.')