#ГолубеваЕ.А.
#1Вариант задача2
#18.04.17
#Напишите программу, которая будет сообщать род деятельности и псевдоним под
#которым скрывается Аркадий Петрович Голиков. После вывода информации
#программа должна дожидаться пока пользователь нажмет Enter для выхода.
print("Не любит тот, кто любит не на век.")
print("Автор- Еврипид.")
input("\n\nНажмите Enter")
