# Задача 3. Вариант 23.
# Напишите программу, которая выводит имя "София Шиколоне", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире

#   Яндиев Д. Б.
#   15.04.17

print("Герой нашей сегодняшней программы - София Шиколоне")
vvod = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Все верно: София Шиколоне -", vvod)
input("\n\nНажмите Enter, чтобы выйти.")
