# Задача 2. Вариант 23.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Наполеон Бонапарт. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#   Яндиев Д. Б.
#   15.04.17

print("Любовь для праздного человека — занятие, для воина — развлечение, для государя — подводный камень.")
print("\n\t\t\t\t\t\t\t\t Наполеон Бонапарт")
input("\n\nНажмите Enter, чтобый выйти.")
