#   Задача	1. Вариант 23.
#   Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Конрад Джозеф Английский писатель Юзеф Теодор Конрад Коженевский. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#   Яндиев Д. Б.
#   15.04.17

print("Юзеф Теодор Конрад Коженевский более известен, как английский писатель Конрад Джозеф.")
input("\n\nНажмите Enter для выхода")
