#Задание 3.Вариант 12.

#Марчук А.Ю.
#27.03.2017

print(' персона дня- Тициано Вечеллио')
apple=input(' Какой псевдоним у Тициано Вечеллио?') 
print('Все верно, Тициано Вечеллио-' ,apple)
input (' Нажми enter для выхода') 