#Задание 2.Вариант 12.
#Напишите программу, которая будет выводить на экран
#наиболее понравившееся вам высказывание, 
#автором которого является Анвари.
#Не забудьте о том, что автор должен быть 
#упомянут на отдельной строке.

#Марчук А.Ю.
#27.03.2017

print('\n "Для человека мысль-'+
'венец всего живого,'+
'А чистота души есть бытия основа."')
print('\t\t\t\t\t\t\t\t\t\t\t"Анвари"')
input('Нажми Enter для выхода') 