#Задание 4. Вариант 12.
#Напишите прогрумму, которая выводит имя, под которым скрывается Лариса
#Петровна Косач-Квитка. Дополнительно необходимо вывести область интересов
#указанной личности, место рождения, годы рождения и смерти
#(если человек умер),вычислить возраст на данный момент (или момент смерти). 
#Для хранения всех необходимых данных трбуется использовать переменные.
#После вывода информации программа должна дожидаться пока 
#пользователь нажмет Enter для выхода.

#Марчук А.Ю.
#27.03.2017

print('Лариса Петровна Косач-Квитка более известна, как Леся Украинка')
bplace = 'Новоград-Волынский'
bdate = '13 февраля 1871'
ddate = '19 июля 1913'
interest = 'поэтесса, писательница'
print('Место рождения:',bplace)
print('Дата рождения:',bdate)
print('Дата смерти:',ddate)
print('область интересов:',interest)

input(' Введите Enter для завершения') 