#Задание 1.Вариант 12.
#Напишите программу, которая будет
#сообщать род деятельности и
#псевдоним под которым скрывается Мария Луиза Чеччарелли.
#После вывода информации программа должна 
#дожидаться пока пользовательно нажмет Enter для выхода.
 
#Марчук А.Ю.
#27.03.2017
print ('Моника Витти, настоящее имя - Мария Луиза Чеччарелли-итальянская актриса.')
input(' Нажми Enter для выхода')