# Задача 1. Вариант 9.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Борис Николаевич Бугаев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Казазаев Дмитрий Евгеньевич
# 23.04.2017

print("Борис Николаевич Бугаев более известен, как русский писатель Александр Белый.")

input("\nНажмите Enter для выхода.")
