# Задача 1. Вариант 8.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Эдуард Георгиевич Зюбин. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Matveev V.M.
# 12.04.2017

print("""Эдуард Георгиевич Зюбин более известен, как русский поэт, переводчик и 
драматург, использовавший псевдонимы - Эдуард Багрицкий или Нина Воскресенская""")
input("\n\nНажмите Enter, чтобы выйти")
