# Задача 4. Вариант 7.
# Напишите программу, которая выводит имя, под которым скрывается Мария Луиза
# Чеччарелли. Дополнительно необходимо вывести область интересов указанной
# личности, место рождения, годы рождения и смерти (если человек умер),
# вычислить возраст на данный момент (или момент смерти). Для хранения всех
# необходимых данных требуется использовать переменные. После вывода
# информации программа должна дожидаться пока пользователь нажмет Enter для
# выхода.

# Matveev V.M.
# 12.04.2017

name="Моника Витти"
print("Мария Луиза Чеччарелли более известна, как известная")
print("итальянская актриса ", name)
place=input("\nМесто рождения:")
start_year=int(input("\nГод рождения:"))
age=print("\nВозраст:",2017-start_year)
hobbi=input("\nОбласть интересов:")
input("\nНажмите Enter, чтобы выйти.")

