# Задача 3. Вариант 7.
# Напишите программу, которая выводит имя "Мэри Анн Эванс", и запрашивает его
# псевдоним. Программа должна сцеплять две эти строки и выводить полученную
# строку, разделяя имя и псевдоним с помощью тире.

# Matveev V.M.
# 14.04.2017

name="Мэри Анн Эванс"
print("Героиня нашей сегодняшней программы -", name)
psevdo=input("Под каким же именем мы знаем этого человека?:")
print("Все верно:", name, " - ", psevdo)
input("\n\nНажмите Enter, чтобы выйти.")
