# Задача 2. Вариант 7.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
#вам высказывание, автором которого является Стендаль. Не забудьте о том, что
#автор должен быть упомянут на отдельной строке.

# Matveev V.M.
# 12.04.2017

print("""Главное достоинство языка - в ясности.
                                Фредерик Стендаль""")


input("Нажмите Enter, чтобы выйти.")

