#Задача 1. Вариант 19.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Илья Арнольдович Файзильберг. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Margiev M.U.
#15.04.2017

print('Илья Арнольдович Ильф при рождении Иехиел-Лейб Арьевич Файнзильберг — русский советский писатель, журналист и сценарист.')
input('\n\nНажмите Enter для выхода.')