#Задание 2.Вариант 19
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхил. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Margiev M.U.
#15.04.2017

print("Мудр не тот, кто знает много, а тот, чьи знания полезны.")
print("\n\t\t\t\t\t\tЭсхил")
input("\n\nНажмите Enter для выхода.")