# Задача 1. Вариант 19.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Илья Арнольдович Файзильберг. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Tyshlek D.N.
# 18.04.2017

print("Илья́ Арно́льдович Ильф (при рождении Иехи́ел-Лейб Арьевич Фа́йнзильберг;[2][3][4] 3 (15) октября 1897, Одесса — 13 апреля 1937, Москва) — русский советский писатель, журналист и сценарист.")
input("\n\nНажмите Enter для выхода.")






