# Задача 2. Вариант 19.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Эсхил. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Tyshlek D.N.
# 18.04.2017
print("Казаться глупым мудрому не страшно.")
print("©Эсхил")
input("\n\nНажмите Enter для выхода.")