# Задача 1. Вариант 7.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Эдуард Георгиевич Зюбин. После вывода информации программа должна
# дожидаться пока пользователь нажмет Enter для выхода.

# Lysenko N. A.
# 23.03.2017

print ('Эдуард Георгиевич Зюбин более известен обществу, как Багрицкий Эдуард. Русский и советский поэт.')

input ('\n\nНажмите Enter для выхода.')
