# Задача 3. Вариант 7.
# Напишите программу, которая выводит имя "Мэри Анн Эванс", и запрашивает его псевдоним.
# Программа должна сцеплять две эти строки и выводить полученную строку, 
# разделяя имя и псевдоним с помощью тире.

# Lysenko N.A.
# 23.03.2017

name = 'Мэри Анн Эванс'
print ('Герой нашей передачи - ', name)
psev = input('А под каким псевдонимом известен этот человек? Ваш ответ: ')
print ('Все верно: ', name, ' - ', psev)
input ('\n\nНажмите Enter для выхода.')
