# Задача 2. Вариант 7.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам 
# высказывание, автором которого является Стендаль. Не забудьте о том, что автор должен
# быть упомянут на отдельной строке.

# Lysenko N.A.
# 23.03.2017

print ('Единственным извинением Бога служит то, что он не существует.')
print ('\t\t\t\t\t\tФ. Стендаль')
input ('\n\nНажмите Enter для выхода.')
