#Задача 2. Вариант 3.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Нострадамус. Не забудьте о том, что автор должен быть упомянут на отдельной строке.+

#Галахова Елена Дмитриевна
#16.03.2017

print('Жизнь - это череда выборов.') 
print('\t\t\t\t Настрадамус.') 
input('Нажмите Enter')
