# Задача 2. Вариант 13.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Саади Ширази. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Torukalo A.U.
# 10.04.2017

print("""
Кто милостив к разбойнику, тот сам
Разбойникам подобен и ворам.
                                           Саади Ширази""")

input("\n\nНажмите Enter для выхода.")
