# Задача 1. Вариант 13.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мария Луиза Полякова — Байдарова. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Torukalo A.U.
# 10.04.2017

print("Мария Луиза Полякова — Байдарова более известная, как французская актриса и певица русского происхождения Марина Влади.")

input("\n\nНажмите Enter для выхода.")
