# Задача 1. Вариант 18.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Михаил Николаевич Румянцев. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Lushakov P. N.
# 01.03.2017

print('Михаил Николаевич Румянцев(Карандаш) - советский артист цирка')
input('\n\nНажмите Enter для выхода.')