# Задача 1. Вариант 14.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Мари Фрасуа Аруэ. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Shchetinina V. N. 
# 26.03.2017

print('Мари Фрасуа Аруэ более известен, как Вольтер - один из крупнейших французских философов-просветителей XVIII века: поэт,прозаик,сатирик,трагик,историк,публицист')

input('\n\nНажмите Enter для выхода.')
