# Задача 1. Вариант 16
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Грета Густафсон.

# Komissarov N.D.
# 15.04.2017

print("Грета Густафсон была более известена как американская актриса Грета Гарбо\n\n")
input("Введите Enter для выхода")
