# Задание 5. Вариант 16.
# Напишите программу, которая бы при запуске случайным образом отображала имя одной из девяти муз в древнегреческой мифологии.

# Komissarov N.D.
# 15.04.2017

import random

print("Программа случайным образом отображает имя одной из девяти муз в древнегреческой мифологии. \n\n", random.choice(["Каллиопа", "Клио","Мельпомена", "Талия", "Полигимния", "Терпсихора", "Эвтерпа", "Эрато", "Урания"]))
input("\n \n Нажмите Enter для выхода")
