# Задача 3. Вариант 16.
# Напишите программу, которая выводит имя "Мария Луиза Полякова — Байдарова", и запрашивает его псевдоним.


# Komissarov N.D.
# 15.04.17

print("Наш гость - Мария Луиза Полякова — Байдарова")
pseudonym = input("Под каким же именем мы знаем ее? Ваш ответ: ")
print("Все верно: Мария Луиза Полякова — Байдарова -", pseudonym)
input("\n\nНажмите Enter, чтобы выйти.")
