#Задача N 4 Вариант 7
#Напишите программу, которая выводит имя, под которым скрывается Мария Луиза Чеччарелли. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Горянин Дмитрий Сергеевич
#28.03.2017
name = 'Мария Луиза Чеччарелли'
intrestings = 'искусство'
realname = 'Моника Витти'
place = 'Рим, Италия'
yearb = 1931
years = 85
print (name, "более известна, как итальянская актриса", realname, ".")
print ("Место рождения:", place)
print ("Год рождения", yearb)
print ("Возраст:", years)
print ("Область интересов:", intrestings)
input ("Нажмите Enter для выхода")
