# Задача N 1 Вариант 7
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода
# Горянин Дмитрий Сергеевич
# 28.02.2017
name ="Мэри Анн Эванс"
print ("герой нашей сегодняшней программы ",name)
answer=input (" Под каким же именем мыы знаем этого человека? ваш ответ ")
print("всё верно!", name,"-" ,answer)
input (" Введите enter для выхода")