#Задача 8. Вариант 7.
#Доработайте игру "Анаграммы" (см. М.Доусон Программируем на Python. Гл.4) так, чтобы к каждому слову полагалась подсказка. Игрок должен получать право на подсказку в том случае, если у него нет никаких предположений. Разработайте систему начисления очков, по которой бы игроки, отгадавшие слово без подсказки, получали больше тех, кто запросил подсказку.
# Горянин Дмитрий Сергеевич
#04.04.2017
import random
WORDS = ("ромашка", "одуванчик", "роза", "колокольчик")
word = random.choice(WORDS)
correct = word
jumble = " "
balls = 100
help = word[0] + word[1] + word[2]
while word :
 position = random.randrange(len(word))
 jumble += word[position]
 word = word[:position] + word[(position + 1):]
print("""
             Добро пожаловать в игру "Анаграммы"!
Надо переставить буквы так, чтобы получилось осмысленное слово.
      Если вам потребуется подсказка, введите "Не знаю"
	  Но тогда вы не сможете получить максимальный балл (100) 
       (Для выхода нажмите Enter, не вводя своей версии.)
""")
print("Вот анаграмма: ", jumble)
guess = input("\nПопробуйте отгадать исходное слово: ")
while (guess != correct) and (guess != "") and (balls >= 0) :
 if guess == "Не знаю":
     balls -= 50
     print ("Вы воспользовались подсказкой, первые три буквы - ", help )
     guess = input ("Попробуйте отгадать слово снова: ")
 else:
     print("Вы не правы.")
     guess = input ("Попробуйте отгадать слово снова: ")
if guess == correct :
    print("Верно! Вы отгадали слово и набрали ", balls, " баллов.")
input ("Нажмите Enter, чтобы выйти ") 