# Задача N 1 Вариант 7
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. 
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода
# Горянин Дмитрий Сергеевич
# 28.02.2017
print (" Эдуард Георгиевич Багрицкий (настоящая фамилия  Джюбин, Дзюбан")
print()
print (" русский поэт, переводчик и драматург.")
input (" Введите enter для выхода")
