# Задача 4. Вариант 11.
# Напишите программу, которая выводит имя, под которым скрывается Йоханнес Бруфельдт.
# Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти).
# Для хранения всех необходимых данных требуется использовать переменные.
# После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Ovinnikova T.A.
# 14.04.2017

name = 'Йоханнес Бруфельдт'
nick = 'Юхани Ахо'
print (name, ' более известен под именем ', nick)
born = 'Лапинлахти, Финляндия'
print ('Место рождения: ', born)
year = '1861'
print ('Год рождения: ', year)
deth = '1921'
print ('Дата смерти: ', deth)
age = '80'
print ('Возраст на момент смерти: ', age)
input("\n\nНажмите Enter для выхода.")
