# Задача 3. Вариант 15
# Напишите программу, которая выводит имя "Лариса Петровна Косач-Квитка", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Чесноков Илья Сергеевич
# 01.03.2017

print("Герой нашей сегодняшней программы - Лариса Петровна Косач-Квитка")
nickname = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")

print("Все верно: Лариса Петровна Косач-Квитка - ", nickname, "\n\n")
input("Введите Enter для выхода")