# Задача 1. Вариант 15
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Аркадий Петрович Голиков. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Чесноков Илья Сергеевич
# 01.03.2017

print("Аркадий Петрович Голиков был более известен как детский писатель и журналист Аркадий Петрович Гайдар\n\n")
input("Введите Enter для выхода")