# Задача 4. Вариант 15
# Напишите программу, которая выводит имя, под которым скрывается Анри Мари Бейль. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Чесноков Илья Сергеевич
# 01.03.2017

print("Анри Мари Бейл более известен, как французский писатель Стендаль.")
print("Место рождения: Гренобль, Франция")
print("Год рождения: 1783")
print("Год смерти: 1842")
print("Область интересов: литература\n\n")

input("Введите Enter для выхода")