# Задача 2. Вариант 15
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Плутарх. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Чесноков Илья Сергеевич
# 01.03.2017

print("Смелость — начало победы.\n")
print("                 Плутарх\n\n")
input("Введите Enter для выхода")