# Задача 2. Вариант 4.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сократ. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Гауен Юлия Александровна
#16.04.2017

print("Единственная истинная мудрость — в осознании, что мы по сути ничего не знаем.")
print("\t\t\t\t Сократ")
input("\n\n Нажмите Enter, чтобы выйти.")
