# Задача 4. Вариант 4.
# Напишите программу, которая выводит имя, под которым скрывается Джон Гриффит Лондон.

# Гаузен Юлия Александровна
# 16.04.2017

name="Джон Гриффит Чейни"
p="Джек Лондон"
o="писатель"
mr="Сан-Франциско"
gr=1876
gs=1916
v=gs - gr
print(name,",более известен,как",p)
print("Род деятельности:",o)
print("Место рождения:",mr)
print("Год рождения:",gr)
print("Год смерти:",gs)
print("Возраст смерти:",v)
input("\n\nНажмите Enter, чтобы выйти.")



