# Задача 1. Вариант 4.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Фредерик Аустерлиц. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Гаузен Юлия Александровна
# 16.04.2017

print("Фред Астер- актёр, танцор, хореограф и певец, звезда Голливуда, один из величайших мастеров музыкального жанра в кино. Его настоящее имя Фредерик Аустерлиц.")
input("\n\n Нажмите Enter, чтобы выйти.")
