# Задача 1 Вариант 5
# Напишите программу, которая будет сообщать род деятельности и псевдоним подкоторым скрывается Анна Андреевна Горенко. После вывода информациипрограмма должна дожидаться пока пользователь нажмет Enter для выхода.

# Дуненков Р.Е.
# 05.04.2017.

print('псевдоним Анны Андреевны Горенко-Анна Ахматова')
input('press Enter to exit')