# Задача 2 Вариант 5
# Напишите программу, которая будет выводить на экран наиболее понравившеесявам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, чтоавтор должен быть упомянут на отдельной строке.

#Дуненков Р.Е.
#05.04.2017

print('Война — это великое дело государства, основа жизни и смерти, путь к выживанию или гибели. Это нужно тщательно взвесить и обдумать.')
print('                                        © Сюнь-цзы,496 г. до Рождества Христова')
input('press enter to exit')