#	Задача 6. Вариант 10.
# Создайте игру, в которой компьютер загадывает название одной из трех стран, входящих в военно-политический блок "Тройственный союз", а игрок должен его угадать.
#	Mashtakova V.R.
#	17.04.2017

print("Добро пожаловать в Тройственный союз") 
print("--Назови одну из трех стран?\n") 
password=input("Назови страну:") 
if password == "Германия" "Австро-венгрия" "Италия": 
 print ("Верно") 
else: 
 print("Не верно") 
 input("\n\nНажмите Enter, чтобы выйти.")
