#	Задача	4. Вариант 10.
# Напишите	программу,	которая	выводит	имя,	под	которым	скрывается	Уильям Сидни	Портер.	Дополнительно	необходимо	вывести	область	интересов	указанной личности,	место	рождения,	годы	рождения	и	смерти	(если	человек	умер), вычислить	возраст	на	данный	момент	(или	момент	смерти).	Для	хранения	всех необходимых	данных	требуется	использовать	переменные.	После	вывода информации	программа	должна	дожидаться	пока	пользователь	нажмет	Enter	для выхода.

#	Mashtakova V.R.
#	17.04.2017

print("Уильям Сидни Портер известный как О.Генри") 
town = ("Нью-Йорк") 
print("Место рождения", town) 
year = 1862 
print("Год рождения", year) 
year_old=2017-year 
print("Возраст", year_old) 
print("Область интересов - книги") 
input("нажмите Enter для выхода")
