#	Задача	3. Вариант 10.
# Напишите	программу,	которая	выводит	имя	"Игорь	Васильевич	Лотарев",	и запрашивает	его	псевдоним.
# Программа	должна	сцеплятьдве	эти	строки	и выводить	полученную	строку,
# разделяя	имя	и	псевдоним	с	помощью	тире.

#	Mashtakova V.R.
#	17.04.2017

print("Игорь Васильевич Лотарев") 
name=input("назовите псевдоним героя") 
print("Игорь Васильевич Лотарев - ", name) 
input("нажмите Enter для выхода")
