#	Задача	2. Вариант 10.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание,
# автором которого является Юстиниан. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
 
#	Mashtakova V.R.
#	17.04.2017

print("Краткость - сестра таланта.")
print("\n\t\t\t А.П.Чехов")
input("\n\nНажмите Enter, чтобый выйти.")
