# Задача 5. Вариант 11.
# Напишите программу, которая бы при запуске случайным образом отображала имя одного из девяти оленей Санта Клауса

#Savitckii A I
#14.04.2017
import random
x=random.choice(["Дэшер", "Дансер", "Пренсер", "Виксен", "Комета", "Дондер", "Блитцен", "Купидон", "Рудольф"])
print ("Программа случайным образом отображает имя одного из девяти оленей Санта Клайса.")
print (x)

input("\n\nНажмите Enter для выхода.")
