# Задача 3. Вариант 11.
# Напишите программу, которая выводит имя "Анна Андреевна Горенко", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

#Savitckii A I
#14.04.2017
print("Герой нашей сегодняшней программы - Мария Луиза Полякова- Байдарова")
name=input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
print("Всё верно: Мария Луиза Полякова - Байдарова - ", name)

input("\n\nНажмите Enter для выхода.")
