# Задача 2. Вариант 11.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Генри. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Savitckii A I
#14.04.2017
print("""
Таково уж свойство женского пола — плакать от горя, плакать от радости и проливать слезы в отсутствие того и другого. 

                                          О.Генри""")

input("\n\nНажмите Enter для выхода.")
