# Задача 4. Вариант 11.
# Напишите программу, которая выводит имя, под которым скрывается Йоханнес Бруфельдт. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Savitckii A I
#14.04.2017
print("Йоханнес Бруфельдт более известен, как финский писатель Юхани Ахо")
birth="Лапинлахти,Финляндия"
date="1861"
age="59"
death="1921"
area="Литература"
print("Место рождения: ", birth)
print("Год рождения: ", date)
print("Возраст: ", age)
print("Дата смерти: ", death)
print("Область интересов: ", area)

input("\n\nНажмите Enter для выхода.")
