#Задача 1. Вариант 5.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Baranov K. E.
# 05.03.2017
print('Анна Андеевна Ахматова(в девичестве — Горенко, после развода Ахматова — русская поэтесса, переводчица и литературовед')
input('\n\nНажмите Enter для выхода.')
