# Задача 1. Вариант 14.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Франсуа Мари Аруэ. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода

# Русаков В.А.
# 15.04.2017

print("Франсуа Мари Аруэ более известен, как французский философ  Вольтер.")

input("\n\nНажмите Enter для выхода.")

