# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Русаков В.А.
# 15.04.2017

print("Если ты ненавидишь – значит тебя победили.")

print("\n\t\t\t\tКонфуций")

input("\n\nНажмите Enter для выхода.")
