#Задача 1. Вариант 15.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Аркадий Петрович Голиков. 
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода. 

#Shiyanova A.V.
#22.03.2017
print('Аркадий Петрович Голиков более известен, как Аркадий Гайдар')

input('\n\nНажмите Enter для выхода.')