# Задача 2. Вариант 15.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Плутарх. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Shiyanova A.V.
# 22.02.2017

print("Сила речи состоит в умении выразить многое в немногих словах.")

print("\n\t\t\t\t\t\tПлутарх")

input("\n\nНажмите Enter для выхода.")
