# Задача 4. Вариант 5.
# Напишите программу, которая выводит имя, под которым скрывается Фредерик Аустерлиц. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Давиткохвян Юрий Васильевич
# 10.03.2017

name = "Фред Астер"
print("Фредерик Аустерлиц более известен, как американский актер", name)
born = "Омаха, Небраска, США"
print("Место рождения:", born)
year = "1899"
print("Год рождения:", year)
die = "1987"
print("Год смерти:", die)
print("Возраст:", 1987-1899)
work = "кинематограф"
print("Область интересов:", work)
input("\n\nНажмите Enter для выхода.")
