# Задача 1. Вариант 5.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Давиткохвян Юрий Васильевич
# 10.03.2017

print("Анна Андреевна Горенко более известна, как русская поэтесса Анна Андреевна Ахматова")
input("Нахмите Enter для выхода")
