# Задача 2. Вариант 5.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Давиткохвян Юрий Васильевич
# 10.03.2017

print("В учении нельзя останавливаться.")
print("\n\t\t\tСюнь-цзы")
input("Нажмите Enter для выхода")
