# Задача 3. Вариант 5.
# Напишите программу, которая выводит имя "Жан Батист Поклен", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Давиткохвян Юрий Васильевич
# 10.03.2017

print('Герой нашей сегодняшней программы - Жан Батист Поклен')
nick = 'Мольер'
print('Под каким же именем мы знаем этого человека? Ваш ответ:', nick)
name = 'Жан Батист Поклен'
print('Все верно:', name,'-', nick)
input('\n\nНажмите Enter для выхода.')
