# Задача 2. Вариант 10.

# Mongush D.S.
# 05.04.17

#Выводит строку на экран
print("Знать законы — значит воспринять не их слова, но их содержание и значение.")
#Выводит строку на экран (\n - пропуск строки, \t отступ равный tab)
print("\n\t\t\t\t\t\t\t\t Юстиниан")
#Ждёт нажатия Enter для конца программы
input("\n\nНажмите Enter, чтобый выйти.")
