#	Задача	1. Вариант 10.

#	Mongush D.S.
#	05.04.2017

#Выводит строку на экран
print("Ричард Дженкинс более известен, как американский киноактёр Бертон.")
#Ждёт нажатия Enter для конца программы
input("\n\nНажмите Enter для выхода")
