# Задача 4. Вариант 10.

# Mongush D.S.
# 05.04.17

#Присваиваем все необходимые значения переменным
fullname = "Уильям Сидни Портер"
pseudonym = "О. Генри"
intrest = "Писательство"
birth = 1862
death = 1910
age = 47
placeOfBirth = "Гринсборо, Северная Каролина"
#Выводим на экран
print(fullname, "более известен, как американский писатель", pseudonym)
print("Место рождения:", placeOfBirth)
print("Год рождения:", birth)
print("Год смерти:", death)
print("Возраст:", age)
print("Область интересов:", intrest)
input("\n\nНажмите Enter, чтобы выйти.")
