# Задача 3. Вариант 10.

# Mongush D.S.
# 05.04.17

#Выводит строку на экран
print("Герой нашей сегодняшней программы - Игорь Васильевич Лотарев")
#Присваивает переменной vvod значение, введенное с клавиатуры
vvod = input("Под каким же именем мы знаем этого человека? Ваш ответ: ")
#Выводит на экран сначала текст в ковычках и значение переменной через пробел
print("Все верно: Игорь Васильевич Лотарев -", vvod)
#Ждёт нажатия Enter для конца программы
input("\n\nНажмите Enter, чтобы выйти.")
