#задача2.Вариант4.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сократ. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Долгова Е.М.
#01.03.2017

print("Невозможно жить лучше, чем проводить жизнь в стремлении стать лучше")
print("Сократ")
input('\n\Нажмите Enter для выхода.')